Revit 2024 API
FilterNumericValueRule.SetEvaluator Method
 Sets the evaluator that implements the test for this rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void SetEvaluator(
	FilterNumericRuleEvaluator evaluator
)
Visual Basic
Public Sub SetEvaluator ( _
	evaluator As FilterNumericRuleEvaluator _
)
Visual C++
public:
void SetEvaluator(
	FilterNumericRuleEvaluator^ evaluator
)
Parameters
evaluator
Type: Autodesk.Revit.DB.FilterNumericRuleEvaluator
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilterNumericValueRule Class
Autodesk.Revit.DB Namespace